public class Main {
    public static void main(String[] args) {

        System.out.println("Количество бонусеых милей с покупки");

        int ticket = 15555;
        int x = 20;
        int bonuse = 1;

        System.out.println(ticket / x * bonuse);


        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}